
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/takahashigo/aws-ecs-terraform/actions/runs/6032291917)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-07206b77599279d94]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-080560f406407f15a]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0f02832e78f6e2dfe]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b0153885fce04ca4]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00e434556ea5e2b8f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0fba776af7d0a0ae3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bbdcfeafa083cd2a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0afbd3a696cf66d42]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ee221464f4fea9d2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09c7fbaa592d41099]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a0df0b3cac51798e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06a85a3185ba26ebc]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-078df85a1223aebc4]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-081c5df07b4b9db84]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06a85a3185ba26ebc1080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bf35a39473ae8a36]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f9d3335249f21f49]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06baa4459bd13abb7]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f0e15f5310f655d7]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f790d624e974ecae]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-043d38a414d2f69b5]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0a0df0b3cac51798e1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09c7fbaa592d410991080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-07206b77599279d94"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-07206b77599279d94"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-033f317a466bc3a00]
aws_security_group.alb: Creation complete after 4s [id=sg-03615ef4987605c19]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-257126802]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"61dd1527353227e360fa79c28d86c78334256a3e","Vars":{},"WorkflowName":"Terraform"} -->